In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                        columns=['one', 'two', 'three', 'four'])

In [4]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [6]:
data.loc["Ohio"]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [8]:
data.iloc[0:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [9]:
data.loc["Ohio":"New York", "one":"two"]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [11]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [12]:
data .iloc[:,:3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [15]:
data .iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [17]:
data .iloc[:,:3][data.three>6]

          one  two  three
Utah        8    9     10
New York   12   13     14

Arithmetic methods with fill values

In [20]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
 .....: columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [22]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 .....: columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [23]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [29]:
df3=df1.add(df2, fill_value=0)
df3

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# lambda function

In [30]:
# Program to show the use of lambda functions
double = lambda x: x * 2

print(double(5))

10

In [31]:
double = lambda x: x * 2
def double(x):
   return x * 2

In [32]:
my_list = [1, 5, 4, 6, 8, 11, 3, 12]

new_list = list(filter(lambda x: (x%2 == 0) , my_list))

print(new_list)

[4, 6, 8, 12]

<img src='https://i.pinimg.com/originals/b8/0e/19/b80e19765f360202766df527088deb06.gif'>

In [38]:
data.four=data.four.apply(lambda x:x*10)

In [40]:
data

          one  two  three  four
Ohio        0    1      2    30
Colorado    4    5      6    70
Utah        8    9     10   110
New York   12   13     14   150

In [42]:
data['status']=data.four.apply(lambda x: 'small' if x%30==0 else 'big')

In [44]:
data

          one  two  three  four status
Ohio        0    1      2    30  small
Colorado    4    5      6    70    big
Utah        8    9     10   110    big
New York   12   13     14   150  small

In [45]:
def test(arr):
    for a in arr:
        if a>100:
            return 'BIG Value'
        else:
            return 'small Value'

In [46]:
map(test ,[12,32,50,40,80,100,101])

list(map(test ,[12,32,50,40,80,100,101]))

data.map= map(test ,[12,32,50,40,80,100,101])

In [51]:
my_list = [1, 5, 4, 6, 8, 11, 3, 12]

new_list = list(filter(lambda x: (x%2 == 0) , my_list))

print(new_list)

[4, 6, 8, 12]

In [53]:
employee = pd.DataFrame({'id':[123,124,125,126,127,128],
                        'name':["Kamal","Hassan","Umer",'Ali',"Taqi","Zain"],
                        'age':[23,34,54,34,21,45],
                        "salary":[30,56,76,89,45,90],
                        "Depart":["Prod","Supply","Accounts", "Accounts",'Prod',"Prod"],
                        "Service":[5,6,7,2,1,9]})

In [55]:
employee

    id    name  age  salary    Depart  Service
0  123   Kamal   23      30      Prod        5
1  124  Hassan   34      56    Supply        6
2  125    Umer   54      76  Accounts        7
3  126     Ali   34      89  Accounts        2
4  127    Taqi   21      45      Prod        1
5  128    Zain   45      90      Prod        9

In [57]:
employee.shape

(6, 6)

In [60]:
employee.columns

Index(['id', 'name', 'age', 'salary', 'Depart', 'Service'], dtype='object')

In [63]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       6 non-null      int64
 1   name     6 non-null      object
 2   age      6 non-null      int64
 3   salary   6 non-null      int64
 4   Depart   6 non-null      object
 5   Service  6 non-null      int64
dtypes: int64(4), object(2)
memory usage: 416.0+ bytes

In [67]:
employee.describe()

               id        age     salary  Service
count    6.000000   6.000000   6.000000  6.00000
mean   125.500000  35.166667  64.333333  5.00000
std      1.870829  12.671490  24.598103  3.03315
min    123.000000  21.000000  30.000000  1.00000
25%    124.250000  25.750000  47.750000  2.75000
50%    125.500000  34.000000  66.000000  5.50000
75%    126.750000  42.250000  85.750000  6.75000
max    128.000000  54.000000  90.000000  9.00000

EDA= exploratry data analysis

In [69]:
# EDA : Exploratory Data Analysis: Exploring Data values

# Inferential Analysis: Applying stats on data to find future insights.

In [72]:
employee.salary.median()

66.0

In [74]:
employee.salary.mode()

0    30
1    45
2    56
3    76
4    89
5    90
dtype: int64

employee2 = pd.DataFrame({
    'Employee id':[123,124,125,126,127,128,129],
    'Employee name':["Kamal","Hassan","Umer",'Ali',"Taqi","Zain","Noah"],
    'Employee age':[23,np.nan,34,54,34,21,45],
    "Employee  monthly salary":[np.nan,30,56,76,89,45,90],
    "Employee Department":["Prod","Supply","Accounts", "Accounts",'Prod',"Prod","DataScience"],
    "Employee Service as per year":[5,6,7,np.nan,2,1,9]})

employee2.columns = ['id','name','age','salary','dept','service']

In [81]:
employee2 = pd.DataFrame({
    'Employee id':[123,124,125,126,127,128,129],
    'Employee name':["Kamal","Hassan","Umer",'Ali',"Taqi","Zain","Noah"],
    'Employee age':[23,np.nan,34,54,34,21,45],
    "Employee  monthly salary":[np.nan,30,56,76,89,45,90],
    "Employee Department":["Prod","Supply","Accounts", "Accounts",'Prod',"Prod","DataScience"],
    "Employee Service as per year":[5,6,7,np.nan,2,1,9]})

employee2.columns = ['id','name','age','salary','dept','service']

In [82]:
employee2

    id    name   age  salary         dept  service
0  123   Kamal  23.0     NaN         Prod      5.0
1  124  Hassan   NaN    30.0       Supply      6.0
2  125    Umer  34.0    56.0     Accounts      7.0
3  126     Ali  54.0    76.0     Accounts      NaN
4  127    Taqi  34.0    89.0         Prod      2.0
5  128    Zain  21.0    45.0         Prod      1.0
6  129    Noah  45.0    90.0  DataScience      9.0

In [91]:
employee2['id'].dropna(axis=0)

0    123
1    124
2    125
3    126
4    127
5    128
6    129
Name: id, dtype: int64

employee2.dropna['id'](axis=0)

In [93]:
employee2.dropna(subset=["id"], axis=0, inplace=True)

In [94]:
employee2

    id    name   age  salary         dept  service
0  123   Kamal  23.0     NaN         Prod      5.0
1  124  Hassan   NaN    30.0       Supply      6.0
2  125    Umer  34.0    56.0     Accounts      7.0
3  126     Ali  54.0    76.0     Accounts      NaN
4  127    Taqi  34.0    89.0         Prod      2.0
5  128    Zain  21.0    45.0         Prod      1.0
6  129    Noah  45.0    90.0  DataScience      9.0